# PhasesNumber Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaBasedLoadData..::..PhasesNumber Property
AreaBasedLoadData Class See Also
---
The Phases Number of the area based load.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public int PhasesNumber { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PhasesNumber As Integer
	Get
```

Visual C++
---
```text
public:
property int PhasesNumber {
	int get ();
}
```

# Remarks
This property is used to retrieve the Phases Number.
# See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace